# მოამზადეთ ორი ფაილი - myunittest.py & mypytest.py შესაბამისად განათავსეთ დავალებები თითოეულში.
#
# #1 unittest1
#
# შექმენით Calculator კლასი add, subtract, multiply, divide მეთოდებით. დაწერეთ unittest რომელიც ამოწმებს ყველა მეთოდს.
# გაითვალისწინეთ 0-ზე გაყოფაც.
# გამოიყენეთ unittest მოდული
#
#
#
#
# #2 unittest2
#
# შექმენით ფუნქციები deposit და withdraw მეთოდებით. დაწერეთ unittest რომელიც ამოწმებს:
#
# - სწორი ბალანსი
#
# - უარყოფითი თანხის შეტანისას შეცდომა
#
# - თანხის გამოტანა ბალანსზე მეტისას შეცდომა
#
#
# #3 unittest3
#
# შექმენით ფუნქცია რომელიც იღებს JSON (dict) response-ს და აბრუნებს "status"-ის მნიშვნელობას. თუ status არ არსებობს → შეცდომა.
# დაწერეთ ტესტები
#
#
#
# #4 pytest2
#
# შექმენით ფუნქცია რომელიც ამოწმებს მომხმარებლის ლოგინს და პაროლს dictionary-დან
# pytest-ში გამოიყენეთ raises შეცდომის დასატესტად
#
# ნიმუში: raise ValueError
#
#
#
# #5 pytest3
#
# დაწერეთ ფუნქცია, რომელიც ამოწმებს არის თუ არა სტრიქონი სწორი email (ანუ შეიცავს @ და . სიმბოლოებს)
# pytest-ით გააკეთეთ ტესტები
#
#
#
# #6 შექმენით თამაში HangMan - სადაც ცვლადში შეინახავთ სიტყვას და მომხმარებელს ექნება ასოების შემოტანის საშუალება, თუ გამოიცნობს სანამ ცდების რაოდენობა ამოიწურება გამოიტანე "თქვენ გამოიცანით სიტყვა" თუ ვერ გამოიცნობს და ამოეწურება ცდები გამოიტანე "თქვენ დამარცხდით". ამ ყველაფრისთვის გამოიყენეთ რომელიმე ტესტირების მოდული და გატესტეთ თქვენი დაწერილი კოდი. (აუცილებელია მომხმარებელმა შემოიტანოს მხოლოდ სტრინგი, სხვა მონაცემთა ტიპი უნდა ვუგულებელვყოთ).
#
