# #1 unittest1
#
# შექმენით Calculator კლასი add, subtract, multiply, divide მეთოდებით. დაწერეთ unittest რომელიც ამოწმებს ყველა მეთოდს.
# გაითვალისწინეთ 0-ზე გაყოფაც.
# გამოიყენეთ unittest მოდული
#
#
#
#
# #2 unittest2

# შექმენით ფუნქციები deposit და withdraw მეთოდებით. დაწერეთ unittest რომელიც ამოწმებს:
#
# - სწორი ბალანსი
#
# - უარყოფითი თანხის შეტანისას შეცდომა
#
# - თანხის გამოტანა ბალანსზე მეტისას შეცდომა
#
#
# #3 unittest3
#
# შექმენით ფუნქცია რომელიც იღებს JSON (dict) response-ს და აბრუნებს "status"-ის მნიშვნელობას. თუ status არ არსებობს → შეცდომა.
# დაწერეთ ტესტები
